// Ex04_Polygon_area.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    system("chcp 1251");
    cout << "Введите x1 и y1: \n";
    int x1, y1;
    cin >> x1 >> y1;
    cout << "Введите x2 и y2: \n";
    int x2, y2;
    cin >> x2 >> y2;
    cout << "Введите x3 и y3: \n";
    int x3, y3;
    cin >> x3 >> y3;
    cout << "Введите x4 и y4: \n";
    int x4, y4;
    cin >> x4 >> y4;
    cout << "Введите x5 и y5: \n";
    int x5, y5;
    cin >> x5 >> y5;

    double s = abs((x1 * y2 + x2 * y3 + x3 * y4 + x4 * y5 + x5 * y1 - x2 * y1 - x3 * y2 - x4 * y3 - x5 * y4 - x1 * y5)/2);

    cout.precision(3);
    cout << "Площадь пятиугольника: " << s;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
